app/controllers/api/v1/github/repositories_controller.rb

SELECT  `repositories`.* FROM `repositories` WHERE `repositories`.`id` = 3 LIMIT 1
SELECT  `repositories`.* FROM `repositories` WHERE `repositories`.`id` = 1 LIMIT 1
---
  def show
    @repository = Repository.find_by(id: params[:id])
    return api_not_found('não foi encontrado') if @repository.blank?

SELECT COUNT(*) FROM `repositories`
---
  def refresh_page
    refresh
    return api_success('atualizado com sucesso') if Repository.count.positive?

SELECT COUNT(*) FROM `repositories`
---
  def need_refresh
    refresh if Repository.count.zero?

INSERT INTO `repositories` (`owner_id`, `full_name`, `url`, `default_branch`, `git_url`, `ssh_url`, `clone_url`, `svn_url`, `size`, `watchers_count`, `forks_count`, `open_issues_count`, `score`, `github_id`, `has_issues`, `has_projects`, `has_downloads`, `has_wiki`, `has_pages`, `archived`, `disabled`, `private`, `description`, `created_at`, `updated_at`) VALUES (1, 'zziz/pwc', 'https://api.github.com/repos/zziz/pwc', 'master', 'git://github.com/zziz/pwc.git', 'git@github.com:zziz/pwc.git', 'https://github.com/zziz/pwc.git', 'https://github.com/zziz/pwc', 1643, 13427, 2126, 19, 185, 147081519, TRUE, TRUE, TRUE, TRUE, TRUE, FALSE, FALSE, FALSE, 'Papers with code. Sorted by stars. Updated weekly. ', '2019-11-06 15:42:47', '2019-11-06 15:42:47')
---
  def create_repository(repository, owner)
    Api::Github::RepositoriesService.create_repository_reference(repository,
                                                                 owner)