app/services/api/github/repositories_service.rb

SELECT `repositories`.* FROM `repositories` WHERE (language LIKE CONCAT("%", 'Py', "%"))
SELECT `repositories`.* FROM `repositories` WHERE `repositories`.`language` = 'python'
SELECT  `repositories`.* FROM `repositories` WHERE (language LIKE CONCAT("%", 'python', "%")) ORDER BY stars_coun asc LIMIT 11
---
      def self.execute(params)
        return Repository.order(stars_count: :desc).limit(5) if query_supported(params)

        @repo = Repository.where(nil) # creates an anonymous scope
        @repo = @repo.language(params['language']) if params['language'].present?
        @repo = @repo.limit(params[:limit]) if params[:limit].present?

INSERT INTO `owners` (`login`, `url`, `html_url`, `avatar_url`, `site_admin`, `created_at`, `updated_at`) VALUES ('zziz', 'https://api.github.com/users/zziz', 'https://github.com/zziz', 'https://avatars1.githubusercontent.com/u/2147644?v=4', FALSE, '2019-11-06 18:38:29', '2019-11-06 18:38:29')
SELECT  `owners`.* FROM `owners` WHERE `owners`.`login` = 'zziz' AND `owners`.`url` = 'https://api.github.com/users/zziz' AND `owners`.`html_url` = 'https://github.com/zziz' AND `owners`.`site_admin` = FALSE AND `owners`.`avatar_url` = 'https://avatars1.githubusercontent.com/u/2147644?v=4' LIMIT 1
UPDATE `owners` SET `github_id` = 1360886, `type_of_user` = 'user', `updated_at` = '2019-11-06 18:38:36' WHERE `owners`.`id` = 84
---
      def self.create_owner(params)
        owner = Owner.find_or_create_by(params.as_json(only: %w[login url html_url
                                                             site_admin
                                                             avatar_url]))
        owner.type_of_user = params['type'].downcase
        owner.github_id = params['id']
        owner.save && owner

INSERT INTO `repositories` (`owner_id`, `full_name`, `url`, `default_branch`, `git_url`, `ssh_url`, `clone_url`, `svn_url`, `size`, `watchers_count`, `forks_count`, `open_issues_count`, `score`, `github_id`, `has_issues`, `has_projects`, `has_downloads`, `has_wiki`, `has_pages`, `archived`, `disabled`, `license`, `private`, `description`, `created_at`, `updated_at`) VALUES (6, 'lfai/lfai-landscape', 'https://api.github.com/repos/lfai/lfai-landscape', 'master', 'git://github.com/lfai/lfai-landscape.git', 'git@github.com:lfai/lfai-landscape.git', 'https://github.com/lfai/lfai-landscape.git', 'https://github.com/lfai/lfai-landscape', 25283, 62, 27, 0, 28, 159112371, TRUE, TRUE, TRUE, FALSE, FALSE, FALSE, FALSE, TRUE, FALSE, '🌄Open Source AI Landscape: This interactive landscape similar to that of the CNCF Landscape (https://l.cncf.io/) that sorts through open source AI, ML and DL projects, and shows details including GitHub stars, funding or market cap, first and last commits, contributor count and many more.', '2019-11-06 17:38:43', '2019-11-06 17:38:43')
INSERT INTO `repositories` (`owner_id`, `full_name`, `url`, `default_branch`, `git_url`, `ssh_url`, `clone_url`, `svn_url`, `size`, `watchers_count`, `forks_count`, `open_issues_count`, `score`, `github_id`, `has_issues`, `has_projects`, `has_downloads`, `has_wiki`, `has_pages`, `archived`, `disabled`, `license`, `private`, `description`, `created_at`, `updated_at`) VALUES (64, 'lfai/lfai-landscape', 'https://api.github.com/repos/lfai/lfai-landscape', 'master', 'git://github.com/lfai/lfai-landscape.git', 'git@github.com:lfai/lfai-landscape.git', 'https://github.com/lfai/lfai-landscape.git', 'https://github.com/lfai/lfai-landscape', 25283, 62, 27, 0, 28, 159112371, TRUE, TRUE, TRUE, FALSE, FALSE, FALSE, FALSE, TRUE, FALSE, '🌄Open Source AI Landscape: This interactive landscape similar to that of the CNCF Landscape (https://l.cncf.io/) that sorts through open source AI, ML and DL projects, and shows details including GitHub stars, funding or market cap, first and last commits, contributor count and many more.', '2019-11-06 18:38:30', '2019-11-06 18:38:30')
---
      def self.create_repository_reference(params, owner)
        attributes = params.as_json(only: %w[full_name url default_branch
                                         git_url ssh_url clone_url svn_url home
                                         size watchers_count forks_count
                                         open_issues_count score has_issues has_projects
                                         has_downloads has_wiki has_pages archived disabled license private description])
        repo = Repository.find_or_create_by(attributes)